---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntryTable.GetKeyBasedTreeEntries
source: html/f485fa08-b03d-f113-0140-077c78408884.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryTable.GetKeyBasedTreeEntries Method

Gets the KeyBasedTreeEntries for this table.

## Syntax (C#)
```csharp
public KeyBasedTreeEntries GetKeyBasedTreeEntries()
```

## Returns
The KeyBasedTreeEntries for this table.